aaron-bond.better-comments
agquick.workviews
alefragnani.Bookmarks
asvetliakov.vscode-neovim
batisteo.vscode-django
christian-kohler.npm-intellisense
chrmarti.regex
denoland.vscode-deno
donjayamanne.githistory
donjayamanne.python-extension-pack
eamodio.gitlens
eg2.vscode-npm-script
emilast.LogFileHighlighter
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
formulahendry.auto-rename-tag
Gruntfuggly.todo-tree
humao.rest-client
IBM.output-colorizer
ionutvmi.path-autocomplete
jebbs.plantuml
mads-hartmann.bash-ide-vscode
magicstack.MagicPython
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ja
ms-dotnettools.csharp
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
msjsdiag.debugger-for-chrome
naumovs.color-highlight
oderwat.indent-rainbow
Pivotal.vscode-concourse
Pivotal.vscode-manifest-yaml
PKief.material-icon-theme
ritwickdey.LiveServer
rogalmic.bash-debug
RomanPeshkov.vscode-text-tables
ryu1kn.partial-diff
ryu1kn.text-marker
ryuta46.multi-command
shakram02.bash-beautify
Shan.code-settings-sync
shd101wyy.markdown-preview-enhanced
vscode-icons-team.vscode-icons
vscodevim.vim
WallabyJs.quokka-vscode
wholroyd.jinja
wmaurer.change-case
wwm.better-align
yzhang.markdown-all-in-one
